In [43]:
import numpy as np
import pandas as pd

In [44]:
sozluk1 = {"Isim ": ["Ahmet","Mehmet"], "Spor" : ["Koşu","Yüzme"], "Kalori" : [100,200]}

In [45]:
dataFrame1=pd.DataFrame(sozluk1, index=[0,1])

In [46]:
dataFrame1

    Isim    Spor  Kalori
0   Ahmet   Koşu     100
1  Mehmet  Yüzme     200

In [47]:
sozluk2 = {"Isim ": ["Osman","Levent"], "Spor" : ["Koşu","Yüzme"], "Kalori" : [200,100]}

In [48]:
dataFrame2=pd.DataFrame(sozluk2, index=[2,3])

In [49]:
dataFrame2

    Isim    Spor  Kalori
2   Osman   Koşu     200
3  Levent  Yüzme     100

In [50]:
sozluk3 = {"Isim ": ["Ayşe","Mahmut"], "Spor" : ["Koşu","Badminton"], "Kalori" : [300,400]}

In [51]:
dataFrame3=pd.DataFrame(sozluk3, index=[4,5])

In [52]:
dataFrame3

    Isim        Spor  Kalori
4    Ayşe       Koşu     300
5  Mahmut  Badminton     400

## concatenation

In [53]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

    Isim        Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2   Osman       Koşu     200
3  Levent      Yüzme     100
4    Ayşe       Koşu     300
5  Mahmut  Badminton     400

In [54]:
maasSozluk = {"Isim": ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman": ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas":[200,300,400,500]}

In [55]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [56]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [58]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [60]:
maasDataFrame["Departman"].nunique()## number of unique

3

In [61]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [65]:
def bruttenNete(maas):
    return maas*0.66

In [66]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64